app/controllers/adherents_controller.rb

SELECT "adherents".* FROM "adherents"
---
	def index
		@adherents = Adherent.all

INSERT INTO "adherents" ("created_at", "firstname", "lastname", "phone", "updated_at", "user_email") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2014-11-20 13:10:03.178859"], ["firstname", "test"], ["lastname", "test"], ["phone", "test"], ["updated_at", "2014-11-20 13:10:03.178859"], ["user_email", "semia@gmail.com"]]
---
	def create

		@adherent = Adherent.new(adherent_params)
		if@adherent.save

SELECT  "adherents".* FROM "adherents"  WHERE "adherents"."id" = $1 LIMIT 1  [["id", 1]]
---
 	def show
  		@adherent = Adherent.find(params[:id])

SELECT  "adherents".* FROM "adherents"  WHERE "adherents"."id" = $1 LIMIT 1  [["id", 1]]
---
	def edit
		@adherent = Adherent.find(params[:id])

SELECT  "adherents".* FROM "adherents"  WHERE "adherents"."id" = $1 LIMIT 1  [["id", 1]]
---
	def update
		@adherent = Adherent.find(params[:id])