app/controllers/projects_controller.rb

INSERT INTO "projects" ("author", "created_at", "description", "duration", "furnitures", "history", "name", "plan", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
	def create
		@project = Project.new(project_params)
    	if @project.save